In [4]:
import numpy as np
import pandas as pd
import seaborn as sns

df = sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [7]:
df['sex'].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [8]:
df['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [9]:
df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [10]:
df['time'].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [16]:
df.sort_values('total_bill', ascending=False).head()

     total_bill    tip   sex smoker  day    time  size
170       50.81  10.00  Male    Yes  Sat  Dinner     3
212       48.33   9.00  Male     No  Sat  Dinner     4
59        48.27   6.73  Male     No  Sat  Dinner     4
156       48.17   5.00  Male     No  Sun  Dinner     6
182       45.35   3.50  Male    Yes  Sun  Dinner     3

In [22]:
df.sort_values(['tip', 'total_bill'], ascending=[False, True])

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
212       48.33   9.00    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
..          ...    ...     ...    ...   ...     ...   ...
0         16.99   1.01  Female     No   Sun  Dinner     2
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
236       12.60   1.00    Male    Yes   Sat  Dinner     2

[244 rows x 7 columns]

In [24]:
df.loc[0]

total_bill     16.99
tip             1.01
sex           Female
smoker            No
day              Sun
time          Dinner
size               2
Name: 0, dtype: object

In [26]:
df.loc[0, 'tip']

np.float64(1.01)

In [28]:
df.loc[:5, 'total_bill']

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
5    25.29
Name: total_bill, dtype: float64

In [32]:
df[['total_bill', 'tip']].head()

   total_bill   tip
0       16.99  1.01
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61

In [38]:
# tip이 평균 이상인 데이터만 추출해서 평균값으로 변경
df['tip'].mean()

np.float64(2.99827868852459)

In [37]:
c1 = df['tip'] >= df['tip'].mean()
df.loc[c1, 'tip']

2      3.50
3      3.31
4      3.61
5      4.71
7      3.12
       ...
232    3.39
234    3.00
238    4.67
239    5.92
243    3.00
Name: tip, Length: 121, dtype: float64

In [58]:
df1 = df.copy()

In [56]:
df1.loc[c1, 'tip'] = df['tip'].mean()

In [59]:
df['tip'].where(c1, df['tip'].mean())

0      1.010000
1      2.998279
2      2.998279
3      2.998279
4      3.610000
         ...
239    2.998279
240    2.000000
241    2.998279
242    2.998279
243    3.000000
Name: tip, Length: 244, dtype: float64

In [45]:
df1['tip']

0      1.010000
1      1.660000
2      2.998279
3      2.998279
4      2.998279
         ...
239    2.998279
240    2.000000
241    2.000000
242    1.750000
243    2.998279
Name: tip, Length: 244, dtype: float64

In [47]:
# 성별이 여자면서, tip이 평균 이상인 데이터

In [54]:
c1 = df['sex'] == 'Female'
c2 = df['tip'] >= df['tip'].mean()

In [60]:
df.loc[c1 & c2].head(10)

    total_bill   tip     sex smoker  day    time  size
4        24.59  3.61  Female     No  Sun  Dinner     4
11       35.26  5.00  Female     No  Sun  Dinner     4
14       14.83  3.02  Female     No  Sun  Dinner     2
18       16.97  3.50  Female     No  Sun  Dinner     3
29       19.65  3.00  Female     No  Sat  Dinner     2
32       15.06  3.00  Female     No  Sat  Dinner     2
37       16.93  3.07  Female     No  Sat  Dinner     3
52       34.81  5.20  Female     No  Sun  Dinner     4
71       17.07  3.00  Female     No  Sat  Dinner     3
72       26.86  3.14  Female    Yes  Sat  Dinner     2

In [69]:
cd = df['day'].isin(['Sun', 'Sat'])

In [71]:
df.loc[cd]

     total_bill   tip     sex smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2
242       17.82  1.75    Male     No  Sat  Dinner     2

[163 rows x 7 columns]

In [79]:
# 남성 흡연자 조건 필터링
# tip을 많이 낸 순서로 내림차순 정렬
# 상위 10개 출력

In [74]:
c1 = df['sex'] == 'Male'
c2 = df['smoker'] == 'Yes'

In [77]:
df.loc[c1 & c2].sort_values('tip', ascending=False).head()

     total_bill    tip   sex smoker  day    time  size
170       50.81  10.00  Male    Yes  Sat  Dinner     3
183       23.17   6.50  Male    Yes  Sun  Dinner     4
181       23.33   5.65  Male    Yes  Sun  Dinner     2
211       25.89   5.16  Male    Yes  Sat  Dinner     4
172        7.25   5.15  Male    Yes  Sun  Dinner     2

In [80]:
# 식사인원의 5명 이상인 저녁테이블
# 흡연자가 없는 주말 테이블
# total_bill, tip 출력

In [82]:
c1 = df['size'] >= 5
c2 = df['time'] == 'Dinner'
c3 = df['smoker'] == 'No'
c4 = df['day'].isin(['Sun', 'Sat'])

In [83]:
df.loc[c1 & c2 & c3 & c4, ['total_bill', 'tip']]

     total_bill   tip
155       29.85  5.14
156       48.17  5.00
185       20.69  5.00